1c/InformationRegisters/МИКО_аиРезультатыЗадачОбзвона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>МИКО_аиРезультатыЗадачОбзвона</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>taskId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>linkedId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>callFile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>result</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>outDialState</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>inDialState</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>state</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>verboseCallId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cause</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>changeTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>closeTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успешный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МИКО_аиЗадачаНаОбзвон</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>phoneId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>attemptNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/InformationRegisters/МИКО_аиРезультатыЗадачОпроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>МИКО_аиРезультатыЗадачОпроса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>taskId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>pollingId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>result</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>exten</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>changeTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МИКО_аиЗадачаНаОбзвон</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>phoneId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>questionCrmId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/Documents/МИКО_аиЗадачаНаОбзвон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МИКО_аиЗадачаНаОбзвон</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МИКО_аиОпросы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЧислоКаналов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НомераТелефонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>phoneId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>timeCallAllow</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметSpeach</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметSpeach1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметSpeach2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/CommonModules/МИКО_аиСинхронизация/Ext/Module.bsl
///
// Регламентные задачи.
///

// Синхронизация выполнения задач.
// 
Процедура СонхронизацияЗадач() Экспорт
	changeTime = Формат(НачалоДня(ТекущаяДата()) - дата(1970,1,1,1,0,0), "ЧГ=0");    		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МИКО_аиРезультатыЗадачОбзвона.changeTime КАК changeTime
		|ИЗ
		|	РегистрСведений.МИКО_аиРезультатыЗадачОбзвона КАК МИКО_аиРезультатыЗадачОбзвона
		|
		|УПОРЯДОЧИТЬ ПО
		|	changeTime УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	changeTime = ВыборкаДетальныеЗаписи.changeTime;
		Прервать;
	КонецЦикла;
	
	ОтветСервера  = МИКО_аиAPI.ПолучитьРезультатыЗадач(changeTime);     
	КэшДокументов = Новый Соответствие;
	
	НачатьТранзакцию();                    
	Данные  =  Новый Структура("result");
	ЗаполнитьЗначенияСвойств(Данные, ОтветСервера);  
	Если Данные.result = Истина Тогда
		Для каждого result Из ОтветСервера.data.results Цикл 
			changeTime = Макс(Число(result.changeTime), changeTime); 	
			Ссылка = КэшДокументов.Получить(result.taskId);
			Если Ссылка = Неопределено Тогда
				Ссылка = Документы.МИКО_аиЗадачаНаОбзвон.НайтиПоРеквизиту("ИдентификаторЗадачи", Число(result.taskId)); 
			    КэшДокументов.Вставить(result.taskId, Ссылка); 
			КонецЕсли;
			Если Ссылка = Документы.МИКО_аиЗадачаНаОбзвон.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			
			МЗ = РегистрыСведений.МИКО_аиРезультатыЗадачОбзвона.СоздатьМенеджерЗаписи();
			МЗ.Задача = Ссылка;
			ЗаполнитьЗначенияСвойств(МЗ, result); 
			МЗ.Успешный = Найти(МЗ.result, "SUCCESS") = 1;
			МЗ.Записать();
		КонецЦикла;
	КонецЕсли;

	МЗ = РегистрыСведений.МИКО_аиРезультатыЗадачОбзвона.СоздатьМенеджерЗаписи();
	МЗ.changeTime = changeTime;
	МЗ.Записать();
	
	ИзмененныеДокументы = Новый Массив;
	Для каждого данныеДокумента Из КэшДокументов Цикл
	 	ИзмененныеДокументы.Добавить(данныеДокумента.Значение);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаНаОбзвонНомераТелефонов.Ссылка КАК Ссылка,
		|	МИНИМУМ(МИКО_аиРезультатыЗадачОбзвона.closeTime) КАК closeTime
		|ИЗ
		|	Документ.МИКО_аиЗадачаНаОбзвон.НомераТелефонов КАК ЗадачаНаОбзвонНомераТелефонов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МИКО_аиРезультатыЗадачОбзвона КАК МИКО_аиРезультатыЗадачОбзвона
		|		ПО ЗадачаНаОбзвонНомераТелефонов.Ссылка = МИКО_аиРезультатыЗадачОбзвона.Задача
		|			И ЗадачаНаОбзвонНомераТелефонов.phoneId = МИКО_аиРезультатыЗадачОбзвона.phoneId
		|ГДЕ
		|	ЗадачаНаОбзвонНомераТелефонов.Ссылка В(&Ссылки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаНаОбзвонНомераТелефонов.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылки", ИзмененныеДокументы);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.closeTime = 0 Тогда
		 	Продолжить;
		КонецЕсли; 
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Состояние = 1;
		ДокОбъект.Записать();
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Загрузка новых результатов опроса.
// 
Процедура СинхронизацияОпросов() Экспорт
  	changeTime = Формат(НачалоДня(ТекущаяДата()) - дата(1970,1,1,1,0,0), "ЧГ=0");    		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МИКО_аиРезультатыЗадачОпроса.changeTime КАК changeTime
		|ИЗ
		|	РегистрСведений.МИКО_аиРезультатыЗадачОпроса КАК МИКО_аиРезультатыЗадачОпроса
		|
		|УПОРЯДОЧИТЬ ПО
		|	changeTime УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	changeTime = ВыборкаДетальныеЗаписи.changeTime;
		Прервать;
	КонецЦикла;
	ОтветСервера = МИКО_аиAPI.ПолучитьРезультатыОпроса(changeTime);
	КэшДокументов = Новый Соответствие;
	
	НачатьТранзакцию();   
	Данные  =  Новый Структура("result");
	ЗаполнитьЗначенияСвойств(Данные, ОтветСервера);    
	Если Данные.result = Истина Тогда
		Для каждого result Из ОтветСервера.data.results Цикл 
			Ссылка = КэшДокументов.Получить(result.taskId);
			Если Ссылка = Неопределено Тогда
				Ссылка = Документы.МИКО_аиЗадачаНаОбзвон.НайтиПоРеквизиту("ИдентификаторЗадачи", Число(result.taskId)); 
			    КэшДокументов.Вставить(result.taskId, Ссылка); 
			КонецЕсли;
			Если Ссылка = Документы.МИКО_аиЗадачаНаОбзвон.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			
			МЗ = РегистрыСведений.МИКО_аиРезультатыЗадачОпроса.СоздатьМенеджерЗаписи();
			МЗ.Задача = Ссылка;
			ЗаполнитьЗначенияСвойств(МЗ, result); 
			МЗ.Записать();
		КонецЦикла;
	КонецЕсли;
 	ЗафиксироватьТранзакцию();

КонецПроцедуры
